---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseWallsweepsForCurtainWall
source: html/1def7289-7eec-6a3b-d569-3553e2340a71.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseWallsweepsForCurtainWall Property

Switching element type to Curtain Family. All Wall Sweeps or Reveals hosted by this instance will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId LooseWallsweepsForCurtainWall { get; }
```